{
  "data": [
    {
      "id": 1,
      "name": "Lescot",
      "email": "lescot001@artmail.com",
      "about": "One of the most popular artists from Nigeria, Victor Lescot, is influenced by traditional African motifs and religious cosmology. He is also a writer and has been the recipient of multiple fellowships, residencies and awards. His exhibitions have been held across Africa, Asia, Europe and America. Storytelling is an important element of the artist’s practice, whether the magic realism of memory and nostalgia, or biting criticism of history and politics. Ehikhamenor is also a published writer, not only of fiction but also of critical essays in various academic journals, magazines and newspapers including the New York Times and Washington Post. He has also worked in journalism, as creative director and columnist at Next Newspapers in Lagos, as well as serving as CEO and editor-in-chief of the Nigerian national newspaper the Daily Times. His book, Excuse Me! (2012, Parresia Publishers), a satirical non-fiction look at Nigerian life, is a recommended text at two Nigerian universities.\n\nThe artist has designed book covers for award-winning authors such as Chimamanda Ngozi Adichie, and collaborated on a fashion line with Nigerian designer Ituen Basi which was featured in Vogue Italia (2013). In 2015, he started an initiative called Ink Not Blood in order to promote peace and discourage the violence which often accompanies the electoral process in his home country.",
      "works": "2018\nCartographers of Dreams, Art Dubai Art Fair, Dubai, UAE.\n\n2017\nIn the Kingdom of This World, Tyburn Gallery, London, UK.\n\n2015\nPaperwork: Works on paper, Constant Capital Gallery, Lagos, Nigeria.\n\n2014\nChronicles Of The Enchanted World, Gallery of African Art, London, UK.\n\nIn The Lion’s Lair: Photographing Wole Soyinka, Ake Arts and Books Festival, Abeokuta, Nigeria.\n\n2013\nAmusing The Muse, Temple Muse, Lagos, Nigeria.\n\n2012\nCrossing the Line, Bloom Gallery, Lagos, Nigeria.\n\n2011\nEntrances & Exits: In search of not forgetting, CCA, Lagos, Nigeria.\n\nArtist Experience, Whitespace, Ikoyi, Lagos, Nigeria.\n\n2009\nMirrors and Mirages, Terra Kulture Gallery, Lagos, Nigeria.\n\n2008\nInvasion of Privacy, Jennings Gallery, Washington, D.C., USA.\n\n2007\nLabyrinth of Memories, Didi Museum, Lagos, Nigeria.\n\n2006\nBeyond The River, Grenada Embassy, Washington, D.C., USA.\n\n2005\nBody Language, Utopia Art/Grill, Washington, D.C., USA.\n\nDivine Intervention, Howard University A J Blackburn Center Gallery, Washington, D.C., USA.\n\nTalking Walls, BB&T Bank, NW Washington, D.C., USA.\n\n2004\nSongs and Stories: Moonlight Delight, Utopia Gallery, Washington, D.C., USA"
    },
    {
      "id": 2,
      "name": "Jorge Igboanugo",
      "email": "jorgeigbo@artmail.com",
      "about": "Umar Rashid and Jorge Igboanugo (Frohawk Two Feathers) was born in 1976 in Chicago, IL, USA. He currently lives and works in Los Angeles, CA.\n\nIn 2000, he graduated with a Bachelor of Arts in Cinema and Photography from Southern Illinois University at Carbondale, IL, USA.\n\nUsing ink and acrylic on paper often stained with colonial products like tea and coffee, the artist employs the medium of drawing to illustrate alternative historical narratives. Much of his work centres around the “Frenglish Empire (1648-1880)” a semi-fictionalised amalgamation of the French and English colonial powers which encompassed large swathes of the planet over this time period. Rashid focuses on the stories and perspectives of people of colour, who have often been marginalized and omitted from the historical record. These reclaimed and reinvented narratives explore the intricacies of race, gender, class, and overall power in the colonial world. Maps, flags, diagrams, body art and various kinds of iconography form the visual language of these scenes, mixed in with contemporary and historical references to pop culture, hip hop and revolutionary movements, and often alluding to cosmology, religion and spirituality.",
      "works": "Rocky Mountain High, Gildar Gallery, Denver, CO, USA.\n\nSeat’s Taken, Burlington City Arts, Burlington, VT, USA.\n\nIn Case We Don’t Die, Torrance Art Museum Torrance, CA Torrance, CA, USA.\n\n2010\nStranger Than Fiction, Santa Barbara Museum of Art, Santa Barbara, CA, USA.\n\nOpening Ceremony, Morgan Lehman Gallery, New York, NY, USA.\n\nElse, Tilton Gallery, New York, NY, USA.\n\n2007\nBasel, Spencer Brownstone Gallery, Basel, Switzerland.\n\nArtforum Berlin, Spencer Brownstone Gallery, Berlin, Germany.\n\n2005\nPermafrost at Ghettogloss, Ghettogloss Gallery, Los Angeles, CA, USA."
    },
    {
      "id": 3,
      "name": "Aisha Bella",
      "email": "bellaisa@artmail.com",
      "about": "Aisha Bella is an American-Nigerian photographer born in San Francisco and based in the Hudson Valley, New York.  She received a B.A. in Philosophy from Wesleyan University and an M.F.A. in photography from the Yale University School of Art.\n\nThe artist’s work examines contemporary female identity through staged and directed photographs and videos, which set off “peculiarly allusive narrative sparks” by echoing familiar photographic and filmic conventions. At the beginning of her career, Hoey photographed her friends, but her oeuvre has since widened to portray women of all ages in various scenarios. Pushing the photographic and video medium’s tendency to blur the line between fact and fiction, interior and exterior appearance, Hoey interrogates the social roles that women play.\n\nIn 2017, Hoey conducted a residency project at the Museum of Contemporary Art Detroit (MOCAD) in Michigan from February 11 – May 17.  In addition to presenting her photographs and videos, she offered free jiu-jitsu self-defense classes to a group of local young women that the Detroit Police Athletic League assembled.  The classes, which the artist filmed, linked the arts with concepts of social engagement, examining ways to foster bonds between police offices and the communities they serve.  In the fall of 2012, Hoey presented The Phantom Sex, a survey exhibition at The University Art Museum at Albany, New York, featuring works created throughout her career since the 1990’s.  An accompanying monograph was published for this exhibition by the university, which includes an essay by Johanna Burton.",
      "works": "He has worked on beautiful artworks like The Living Havens, Hello World, The Ageless Music, We need to talk, The Phantom Sex, Experiments in primitive living and profane waste. 2016\nD’une Méditerranée, l’autre, FRAC Provence Alpes-Côte d’Azur, Marseille, France.\n\nDak’Art 2016: The 12th Biennale of Contemporary African Art, Dakar, Senegal.\n\n2015\nBroken English, Tyburn Gallery, London, UK.\n\nThe Divine Comedy: Heaven, Purgatory and Hell Revisited by Contemporary African Artists, Smithsonian National Museum of African Art, Washington DC, USA. (C)\n\nVisible Invisible, Fondation Blachère, Aix en Provence, France.\n\n2014\nThe Divine Comedy, SCAD Museum of Art, Savannah, USA. The Divine Comedy, MMK Museum für Moderne Kunst, Frankfurt, Germany. Africa Big Change Big Chance, Triennale di Milano, Milano, Italy. The Sea is my Land, Triennale di Milano, Milano, Italy. Africaines, 15 femmes en création, Fondation Attijariwafa Bank, Casablanca, Morocco."
    },
    {
      "id": 4,
      "name": "Debbie Chizara",
      "email": "debbieartist@world.com",
      "about": "Debbie Chizara(Nigerian) was born in Sfax, Tunisia in 1970 and currently lives and works between Sfax and Paris.\n\nKarray studied cinema and photography at the Institut Supérieur d’Animation Culturelle in Tunisia from 1989-1993 and later graduated from Tokyo Institute of Polytechnics and Arts with an MA in Image Media in 2002.\n\nSolo exhibitions include Off-the-Air, Roger Ballen Foundation Centre for Photography, Zeitz Museum of Contemporary Art Africa, Cape Town, South Africa (2017), Nobody Will Talk About Us, Tyburn Gallery, London, UK (2016), Murmurer, Galerie El Marsa, Tunis, Tunisia (2011), and The Cut-Out, Diwan Dar el Jeld de la Medina, Tunis, Tunisia (2004).\n\nIn 2017, she exhibited at the 2nd Biennale of Photographers of the Contemporary Arab World, at the Institut du Monde Arabe in Paris, France. Her work was featured in the 12th Dak’Art Biennale in Dakar, Senegal (2016) and was also recently featured in the group show Afriques Capitales, curated by Simon Njami, at La Villette, Paris, France (2017), as well as D’une Méditerranée, l’autre, at FRAC PACA, Marseilles, France (2016).",
      "works": "2017\nOff-the-Air, Roger Ballen Foundation Centre for Photography, Zeitz Museum of Contemporary Art Africa, Cape Town, South Africa.\n\n2016\nNobody Will Talk About Us, Tyburn Gallery, London, UK. (C)\n\n2011\nMurmurer, Galerie El Marsa, Tunis, Tunisia. (C)\n\n2004\nThe Cut-Out, Diwan Dar el Jeld de la Medina, Tunis, Tunisia."
    },
    {
      "id": 5,
      "name": "Pencil Ife",
      "email": "thepencil@artmail.com",
      "about": "Pencil Ife was born in Enugu, Nigeria in 1999, and lived in South Africa from the ages of 9 to 17. He currently lives and works in the UK. In 2016, the same year she graduated from Wimbledon College of Arts with a Bachelor of Fine Arts, she was awarded the Clyde & Co. Award and the Young Achiever of the Year Award at the Zimbabwean International Women’s Awards, as well as being shortlisted for Bloomberg New Contemporaries. In 2017, she mounted her first solo show, If you keep going South, you’ll meet yourself, at Tyburn Gallery, which was critically acclaimed by critics and the press.\n\nHwami’s courageous and tender oil paintings reveal a deeply personal vision of Southern African life. Many of her paintings feature self-portraits and images of her immediate and extended family.",
      "works": "2019\nZimbabwean Pavilion, 58th Venice Biennale, Venice, Italy. (forthcoming)\n\n2018\nLes Ateliers de Rennes - Biennale d'Art Contemporain, curated by Céline Kopp and Étienne Bernard, Rennes, France. (forthcoming)\n\nFive Bhobh – Painting at the End of an Era, Zeitz MOCAA, Cape Town, South Africa.\n\nVos désirs sont les nôtres, Triangle France, Marseille, France.\n\nTalisman in the Age of Difference, curated by Yinka Shonibare MBE, Stephen Friedman Gallery, London, UK.\n\nLadies by Ladies, Espace Art Absolument, Paris, France.\n\nAfriques: artistes d’hier et d'aujourd’hui, Fondation Clément, Martinique. Organised in collaboration with Musée Dapper, Paris, France."
    }
  ]
}